OpenFOAM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// The GUI will now write min/max bounds instead of just L, W, H
xmin  -0.0002;
xmax  0.0002;
ymin  -0.000125;
ymax  0.000125;
zmin  -5e-05;
zmax  5e-05;

// The GUI calculates and writes these integer counts here
nx  80;
ny  50;
nz  10;

scale   1;

vertices
(
    ($xmin $ymin $zmin) // 0
    ($xmax $ymin $zmin) // 1
    ($xmax $ymax $zmin) // 2
    ($xmin $ymax $zmin) // 3
    ($xmin $ymin $zmax) // 4
    ($xmax $ymin $zmax) // 5
    ($xmax $ymax $zmax) // 6
    ($xmin $ymax $zmax) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4) // bottom
            (3 7 6 2) // top
            (0 3 2 1) // back
            (4 5 6 7) // front
        );
    }
);

mergePatchPairs
(
);
// ************************************************************************* //