OpenFOAM/constant/kinematicCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kinematicCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// --- EXPERIMENTAL PARAMETERS (Targeted by GUI) ---
rho0Val     1100;
dPart       1e-06;
sigmaVal    1e-08;    // Active Motion / Brownian Intensity
eRest       0.8;      // Pillar Rebound/Slip coefficient
coupledVal  false;    // Advection Coupling
// -------------------------------------------------

solution
{
    active          true;
    coupled         $coupledVal; 
    transient       true;
    trackInValidCells   false;
    cellValueSourceCorrection false; // Required for OF2512 uncoupled solvers

    // CHANGED: Added rho and mu so the solver can calculate Drag
    interpolationSchemes 
    { 
        rho             cell;
        U               cell; 
        mu              cell;
    }
    
    integrationSchemes   
    { 
        U               Euler; 
    }
}

constantProperties
{
    rho0            $rho0Val;
    youngsModulus   1e6;
    poissonsRatio   0.35;
}

subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
    }

    injectionModels
        {
            model1
            {
                type            patchInjection;
                patch           inlet;
                U0              (0.001 0 0); 
                parcelBasisType fixed;
                nParticle       1;
                parcelsPerSecond 2000;
                
                // ADD THIS: Tells OpenFOAM to keep the flow rate constant at 1.0 (100%)
                flowRateProfile constant 1.0; 
                
                massTotal       1e-15; 
                SOI             0;           
                duration        1.0;         
                sizeDistribution
                {
                    type fixedValue;
                    fixedValueDistribution
                    {
                        value   $dPart;
                    }
                }
            }
        }

    dispersionModel     none;

    patchInteractionModel localInteraction;
    localInteractionCoeffs
    {
        patches
        (
            "pillars.*"
            {
                type rebound;
                eR   $eRest;
                eN   $eRest;
            }
            "walls.*" 
            { 
                type rebound; 
                eR   0.5; 
                eN   0.5; 
            }
            "inlet"
            {
                type escape;
            }
            "outlet"
            {
                type escape;
            }
        );
    }

    collisionModel          none;
    stochasticCollisionModel none;
    surfaceFilmModel        none;
}
// ************************************************************************* //