OpenFOAM/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// Kinematic Viscosity (m^2/s)
// Syntax: nu [dimensions] value;
nu              nu [0 2 -1 0 0 0 0] 1e-06; // GUI_PARAM_NU

// Fluid Density (kg/m^3)
rhoInf             rhoInf [1 -3 0 0 0 0 0] 1000; // GUI_PARAM_RHO_FLUID

// ************************************************************************* //